app/Models/EmpruntModel.php

    public function getDernierEmpruntLivre($livreId)
    {
        return $this->where('livre_id', $livreId)
                    ->orderBy('date_emprunt', 'DESC')
                    ->first();
---
SELECT *
FROM `emprunts`
WHERE `livre_id` = '1'
ORDER BY `date_emprunt` DESC
 LIMIT 1